soap/swad.getDirectoryTree.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:swad="urn:swad">
 <SOAP-ENV:Body>
  <swad:getDirectoryTree>
   <wsKey></wsKey>
   <courseCode>0</courseCode>
   <groupCode>0</groupCode>
   <treeCode>0</treeCode>
  </swad:getDirectoryTree>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
